//Створення ігрового циклу
let i = 0

while(i < 1) {
    //Запропонування гравцю пройти вікторину, якщо значення false, то вийти з циклу
    let start = confirm("Доброго дня! Чи бажаєте Ви пройти вікторину?")

    if(start == false) {
        break
    }
//Змінні для задання питання та отримання відповіді від гравця
let question1 = "На нашій шкірі може жити більше живих організмів, ніж людей на всій планеті. Так чи ні?"
let answer1 = confirm(question1)

//Перевіка на правильність відповіді
if (answer1 == true) {
    alert("Так, це правда!")
}
else {
    alert("Ні, це не так. Насправді на нашій шкірі може жити більше живих організмів, ніж людей на всій планеті.")
}

//Змінні для задання питання та отримання відповіді від гравця
let question2 = "Три найбагатші родини у світі мають більше активів, ніж 48 найбідніших країн. Так чи ні?"
let answer2 = confirm(question2)

//Перевіка на правильність відповіді
if (answer2 == true) {
    alert("Так, це правда!")
}
else {
    alert("Ні, це не так. Три найбагатші родини у світі мають більше активів, ніж 48 найбідніших країн.")
}

//Змінні для задання питання та отримання відповіді від гравця
let question3 = "Половина населення Землі ніколи не бачили снігу. Так чи ні?"
let answer3 = confirm(question3)

//Перевіка на правильність відповіді
if (answer3 == true) {
    alert("Так, це правда!")
}
else {
    alert("Ні, це не так. Половина населення Землі ніколи не бачили снігу.")
}

//Змінні для задання питання та отримання відповіді від гравця
let question4 = "Чи правда, що блискавка вдаряє в жінок частіше ніж в чоловіків?"
let answer4 = confirm(question4)

//Перевіка на правильність відповіді
if (answer4 == false) {
    alert("Так, це правда!")
}
else {
    alert("Ні, це не так. Блискавка ударяє у чоловіків в 6 разів частіше ніж в жінок!")
}

//Змінні для задання питання та отримання відповіді від гравця
let question5 = "Чи залишилася б кока-кола такого самого кольору, якщо б в неї не додавали барвників?"
let answer5 = confirm(question5)

//Перевіка на правильність відповіді
if (answer5 == false) {
    alert("Так, це правда!")
}
else {
    alert("Ні, це не так. Якщо б в кока-колу не додавали барвників, то вона б була зеленого кольору!")
}

//Змінні для задання питання та отримання відповіді від гравця
let question6 = "Який найсильніший м'яз в людському тілі?"
let answer6 = prompt(question6)
let newAnswer6 = answer6.toLowerCase()

//Перевіка на правильність відповіді
if (newAnswer6 == "язик") {
    alert("Так, дійсно! Найсильніший м'яз людського тіла - це язик.")
}
else {
    alert("Ні, це не так. Найсильніший м'яз людського тіла - це язик.")
}

//Змінні для задання питання та отримання відповіді від гравця
let question7 = "Скільки в середньому питань задає чотирирічна дитина за день?"
let answer7 = prompt(question7)
parseInt(answer7)

//Перевіка на правильність відповіді
if (answer7 == 400) {
    alert("Так, дійсно! В середньому чотирирічна дитина задає цілих 400 запитань за день! Чи ви все ще хочете дітей?")
}
else if (answer7 > 400) {
    alert("На жаль, ви трохи перестарались. Чотирирічна дитина в середньому задає 400 запитань в день")
}
else {
    alert("Ні, це не так. В середньому чотирирічна дитина задає аж 400 запитань за день! Важко уявити що відчувають батьки...")
}

//Завершення ігрового циклу
i++

//Пропозиція повторити гру
let oneMore = confirm("Чи бажаєте ви повторити?")

if(oneMore == true) {
    i--
}
}