//Створення ігрового циклу
let i = 0

while(i < 1) {
    //Запропонування гравцю пройти вікторину, якщо значення false, то вийти з циклу
    let start = confirm("Доброго дня! Чи бажаєте Ви пройти вікторину?")

    //Вихід з циклу, якщо користувач відмовився проходити вікторину
    if(start == false) {
        break
    }
//Змінні для задання питання та отримання відповіді від гравця
let question1 = "На нашій шкірі може жити більше живих організмів, ніж людей на всій планеті. Так чи ні?"
let answer1 = confirm(question1)

//Перевіка на правильність відповіді
switch (answer1) {
    case true: 
        alert("Так, це правда!")
        break
    case false: 
        alert("Ні, це не так. Насправді на нашій шкірі може жити більше живих організмів, ніж людей на всій планеті.")
        break
}

//Змінні для задання питання та отримання відповіді від гравця
let question2 = "Три найбагатші родини у світі мають більше активів, ніж 48 найбідніших країн. Так чи ні?"
let answer2 = confirm(question2)

//Перевіка на правильність відповіді
switch (answer2) {
    case true: 
        alert("Так, це правда!")
        break
    case false:
         alert("Ні, це не так. Три найбагатші родини у світі мають більше активів, ніж 48 найбідніших країн.")
         break
}

//Змінні для задання питання та отримання відповіді від гравця
let question3 = "Половина населення Землі ніколи не бачили снігу. Так чи ні?"
let answer3 = confirm(question3)

//Перевіка на правильність відповіді
switch (answer3) {
    case true:
         alert("Так, це правда!")
         break
    case false: 
        alert("Ні, це не так. Половина населення Землі ніколи не бачили снігу.")
        break
}

//Змінні для задання питання та отримання відповіді від гравця
let question4 = "Чи правда, що блискавка вдаряє в жінок частіше ніж в чоловіків?"
let answer4 = confirm(question4)

//Перевіка на правильність відповіді
switch (answer4) {
    case false:
         alert("Так, це правда!")
         break
    case true:
         alert("Ні, це не так. Блискавка ударяє у чоловіків в 6 разів частіше ніж в жінок!")
         break
}

//Змінні для задання питання та отримання відповіді від гравця
let question5 = "Чи залишилася б кока-кола такого самого кольору, якщо б в неї не додавали барвників?"
let answer5 = confirm(question5)

//Перевіка на правильність відповіді
switch (answer5) {
    case false:
         alert("Так, це правда!")
         break
    case true:
         alert("Ні, це не так. Якщо б в кока-колу не додавали барвників, то вона б була зеленого кольору!")
         break
}

//Змінні для задання питання та отримання відповіді від гравця
let question6 = "Який найсильніший м'яз в людському тілі?"
let answer6 = prompt(question6)
let newAnswer6 = answer6.toLowerCase()

//Цикл, який повторюватиме одне й те саме питання, якщо не вказано ні одного символу
while(newAnswer6.length == 0) {
    answer6 = prompt(question6)
    newAnswer6 = answer6.toLowerCase()
    if (newAnswer6.length > 0) {
        break
    }
}

//Перевірка на правильність відповіді
switch (newAnswer6) {
    case "язик":
        alert("Так, дійсно! Найсильніший м'яз людського тіла - це язик.")
        break
    default:
        alert("Ні, це не так. Найсильніший м'яз людського тіла - це язик.")
        break
}


//Змінні для задання питання та отримання відповіді від гравця
let question7 = "Скільки в середньому питань задає чотирирічна дитина за день?"
let answer7 = prompt(question7)
parseInt(answer7)

//Цикл, який повторюватиме одне й те саме питання, якщо не вказано ні одного символу
while(answer7.length == 0) {
    answer7 = prompt(question7)
    parseInt(answer7)
    if (answer7.length > 0) {
        break
    }
}

//Перевіка на правильність відповіді
if (answer7 == 400) {
    alert("Так, дійсно! В середньому чотирирічна дитина задає цілих 400 запитань за день! Чи ви все ще хочете дітей?")
}
else if (answer7 > 400) {
    alert("На жаль, ви трохи перестарались. Чотирирічна дитина в середньому задає 400 запитань в день")
}
else {
    alert("Ні, це не так. В середньому чотирирічна дитина задає аж 400 запитань за день! Важко уявити що відчувають батьки...")
}

//Завершення ігрового циклу
i++

//Пропозиція повторити гру
let oneMore = confirm("Чи бажаєте ви повторити?")

switch(oneMore) {
    case true:  
         i--
         break
}
}