let question1 = "На нашій шкірі може жити більше живих організмів, ніж людей на всій планеті. Так чи ні?"
let answer1 = confirm(question1)

if (answer1 == true) {
    alert("Так, це правда!")
}
else {
    alert("Ні, це не так. Насправді на нашій шкірі може жити більше живих організмів, ніж людей на всій планеті.")
}
let question2 = "Три найбагатші родини у світі мають більше активів, ніж 48 найбідніших країн. Так чи ні?"
let answer2 = confirm(question2)

if (answer2 == true) {
    alert("Так, це правда!")
}
else {
    alert("Ні, це не так. Три найбагатші родини у світі мають більше активів, ніж 48 найбідніших країн.")
}

let question3 = "Половина населення Землі ніколи не бачили снігу. Так чи ні?"
let answer3 = confirm(question3)

if (answer3 == true) {
    alert("Так, це правда!")
}
else {
    alert("Ні, це не так. Половина населення Землі ніколи не бачили снігу.")
}

let question4 = "Чи правда, що блискавка вдаряє в жінок частіше ніж в чоловіків?"
let answer4 = confirm(question4)

if (answer4 == false) {
    alert("Так, це правда!")
}
else {
    alert("Ні, це не так. Блискавка ударяє у чоловіків в 6 разів частіше ніж в жінок!")
}

let question5 = "Чи залишилася б кока-кола такого самого кольору, якщо б в неї не додавали барвників?"
let answer5 = confirm(question5)

if (answer5 == false) {
    alert("Так, це правда!")
}
else {
    alert("Ні, це не так. Якщо б в кока-колу не додавали барвників, то вона б була зеленого кольору!")
}

let question6 = "Який найсильніший м'яз в людському тілі?"
let answer6 = prompt(question6)
let newAnswer6 = answer6.toLowerCase()

if (newAnswer6 == "язик") {
    alert("Так, дійсно! Найсильніший м'яз людського тіла - це язик.")
}
else {
    alert("Ні, це не так. Найсильніший м'яз людського тіла - це язик.")
}

let question7 = "Скільки в середньому питань задає чотирирічна дитина за день?"
let answer7 = prompt(question7)
parseInt(answer7)

if (answer7 == 400) {
    alert("Так, дійсно! В середньому чотирирічна дитина задає цілих 400 запитань за день! Чи ви все ще хочете дітей?")
}
else if (answer7 > 400) {
    alert("На жаль, ви трохи перестарались. Чотирирічна дитина в середньому задає 400 запитань в день")
}
else {
    alert("Ні, це не так. В середньому чотирирічна дитина задає аж 400 запитань за день! Важко уявити що відчувають батьки...")
}
